[
  {
    "module": "Ambulatory",
    "qa": [
      {
        "q": "Where do I find tip sheets for ambulatory workflows?",
        "a": "Press F1 → Learning Home Dashboard → select role-specific section.",
        "steps": [
          "Press F1",
          "Learning Home Dashboard",
          "select role-specific section."
        ]
      },
      {
        "q": "How do I set a patient’s preferred lab?",
        "a": "During rooming, in the Rooming Navigator, select the Preferred Lab field."
      },
      {
        "q": "Why isn’t my Medicare Wellness form showing?",
        "a": "Scroll to bottom of Screenings Navigator; if missing, go to Flowsheets → search 'Medicare Wellness'.",
        "steps": [
          "Scroll to bottom of Screenings Navigator; if missing, go to Flowsheets",
          "search 'Medicare Wellness'."
        ]
      },
      {
        "q": "What’s the difference between internal and external referrals?",
        "a": "Internal referrals often require prior auth and coordination; external referrals have simpler routing."
      },
      {
        "q": "A provider is missing from referral orders. What should I do?",
        "a": "Use the FIND tool to enroll the provider into Epic."
      },
      {
        "q": "How do charges drop for immunizations?",
        "a": "Document in Immunization activity → both med and admin charges drop automatically.",
        "steps": [
          "Document in Immunization activity",
          "both med and admin charges drop automatically."
        ]
      },
      {
        "q": "Why didn’t my point-of-care test charge?",
        "a": "Ensure status = Final in Enter/Edit Results; otherwise no charge posts."
      },
      {
        "q": "How do I schedule a telemedicine appointment?",
        "a": "Use the Telemedicine Visit Type when scheduling; otherwise Video Connect won’t activate."
      },
      {
        "q": "Patient says they didn’t get their MyChart code. What do I do?",
        "a": "Regenerate and send via text/email; remind them it’s valid for 14 days."
      },
      {
        "q": "How do I know which pool I belong to?",
        "a": "Open In Basket → pool name shows at top (department name); managers assign if unclear.",
        "steps": [
          "Open In Basket",
          "pool name shows at top (department name); managers assign if unclear."
        ]
      },
      {
        "q": "What if refill requests are still routing to old Ascension Epic?",
        "a": "Submit a ticket to SureScripts including provider name and MRN."
      },
      {
        "q": "Can I use Epic for PDMP checks?",
        "a": "Not yet — log into ILPMP.org until state approves Epic integration."
      }
    ]
  },
  {
    "module": "Pharmacy (Willow)",
    "qa": [
      {
        "q": "What is the In Basket used for in pharmacy?",
        "a": "It’s used for communication between nursing and pharmacy, e.g., med time adjustments, refill requests."
      },
      {
        "q": "What if IV or unit dose cards don’t print automatically?",
        "a": "Use the Card Status or manually reprint labels via the dispensing button."
      },
      {
        "q": "How do I reprint cart fill labels?",
        "a": "Go to dispensing button → reprint labels manually.",
        "steps": [
          "Go to dispensing button",
          "reprint labels manually."
        ]
      },
      {
        "q": "What if my label printer isn’t working?",
        "a": "Reroute printing to another printer; open an IT ticket if issue persists."
      },
      {
        "q": "How do I validate barcodes for new meds from Cardinal?",
        "a": "Use Validate Barcodes workflow; scan med to confirm NDC on central list."
      },
      {
        "q": "What if a medication’s NDC isn’t in the system?",
        "a": "Submit scan details (med name, strength, NDC, manufacturer, cost) so pharmacy can update or assign IID."
      },
      {
        "q": "How are mixture records handled?",
        "a": "Select via clinical edit details; switch base if needed (NS vs dextrose). Ticket if missing."
      },
      {
        "q": "How do I manage patient’s own meds?",
        "a": "Set charge method = no charge, change dispense code to 'patient supply', uncheck patient supply box."
      },
      {
        "q": "Where do I find role-specific tip sheets?",
        "a": "Press F1 → Learning Home Dashboard → select pharmacist or technician.",
        "steps": [
          "Press F1",
          "Learning Home Dashboard",
          "select pharmacist or technician."
        ]
      },
      {
        "q": "What if my ADS tab shows blank IID?",
        "a": "Open IT ticket to request IID for missing medication (except mixtures)."
      }
    ]
  }
]